10/data/attachments/c60628c3d05cd2a3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_2a4c577d-82d0-4656-b44f-1447e3bd2087</nif:username>
            <nif:friendToBeAdded>Samantha_fund_Actions_46520_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>